# Erlang Snippets

A simple repo containing some erlang snippets

## Calculator

```bash
1> c(calculator).
{ok,calculator}
2> calculator:add(2, 5).
7
3> calculator:subtract(5, 3).
2
4> calculator:multiply(10, 5).
50
5> calculator:divide(50, 3).
16.666666666666668
```
